* Jakobshavn95D_I1
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                           | Jakobshavn95D_I1
Place Name                            | Jakobshavn Isbræ
Geographic Location                   | Central West Greenland
Ice Type                              | Ice sheet
Data Reference                        | M. Lüthi email
Data DOI                              | 
Science Reference                     | Lüthi, Martin, Funk, Martin, Iken, Almut, Gogineni, Shivaprasad, Truffer, Martin: Mechanisms of fast flow in Jakobshavns Isbræ, West Greenland: Part III. Measurements of ice deformation, temperature and cross-borehole conductivity in boreholes to the bedrock, Journal of Glaciology 48(162), 369–385, 2002 
Science DOI                           | 10.3189/172756502781831322
Date                                  | 1995
Longitude [°E]                        | -48.6871
Latitude [°N]                         | 69.235
Location source                       | Colgan, 2021
Depth of top measurement [m]          | 344.0
Depth of bottom measurement [m]       | 829.0
Ice thickness [m]                     | 832
Coverage [% of thickness]             | 58
Ice thickness source                  | See science reference
Measured from: Top, Bottom, Relative  | T
General_Note                          | 
Temperature_note                      | 
Thickness_note                        | 
Location_note                         | Location from Geothermal Database
#+end_example

** Temperature

** Thickness

** Location

** Velocity

** Data                                                 :noexport:

#+BEGIN_SRC jupyter-python
import pandas as pd
df = pd.read_csv('temp_depth95.txt', sep='\s+', comment='%', index_col=0, names=['d','t'], usecols=(0,1))
df.iloc[1:10].to_csv('data.csv', float_format='%.3f')
#+END_SRC

#+RESULTS:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -g -k1
#+END_SRC

#+RESULTS: ingest_data
|      d |       t |
| 344.08 | -19.737 |
| 544.88 | -21.606 |
| 645.17 | -17.964 |
| 745.44 |  -5.737 |
| 795.55 |  -0.733 |
| 820.58 |  -0.597 |
| 827.58 |   -0.58 |
| 828.48 |  -0.586 |
| 829.38 |  -0.595 |

